var serv5=new Array("002","008","037","052","059","060","062","065","075","076","084","085","098","099","077"); //story
var upserv5=new Array("097");   //南丁格尔 up
var craft5=new Array("031","032","033","034","035","040","048","057","058","067","075","097","175");    
var len=craft5.length;
for(var i=0;i<len*4/5;i++)
    craft5.push("175"); //理想的王圣 up
var serv4=new Array("006","010","011","014","018","029","030","041","046","047","048","058","066","074","082","087","089","094","078","067","005","003","102","103");   //story
len=serv4.length;
for(var i=0;i<len*3/4;i++){
    serv4.push("100");
    serv4.push("101");  //海伦娜 罗摩up
}
var serv3=new Array("007","009","013","015","017","020","022","023","026","027","028","031","035","042","049","055","056","063","064","071","072","079","080","081","095","032","038"); //story
len=serv3.length;
for(var i=0;i<len*2/7;i++){
    serv3.push("104");
    serv3.push("105");  //比利小子 杰罗尼莫up
}
var craft4=new Array("021","022","023","024","025","026","027","028","029","030","038","039","047","056","066","073","074","098");    //纪录保持者 up
len=craft4.length;
for(var i=0;i<len/3;i++){
    craft4.push("176");   //纪录保持者 up
}
var craft3=new Array("037","042","046","055","065","072","089","090","091","092","093","094","095","096");  
len=craft3.length;
for(var i=0;i<len/4;i++){
    craft3.push("177");   //Freelancer up
}
//freelancer up